[
  {
    "id": "yelpcamp",
    "name": "YelpCamp!",
    "tags": [
      "JavaScript | ",
      "MongoDB | ",
      "Express | ",
      "Node | ",
      "REST API | ",
      "Passport | ",
      "3rd Party API"
    ],
    "stack": ["MongoDB ", "Express ", "Node"],
    "preview": "A web app for camping enthusiasts, YelpCamp! offers functionality similar to any social media site. \n\n Users can create accounts...",
    "summary": "A web app for camping enthusiasts, YelpCamp! offers functionality similar to any social media site. \n\n Users can create accounts, login/logout, add new campsites, leave \n\n comments, and edit or delete their own entries. There is also a password reset function.",
    "approach": "Technical approach: This was a code-along exercise from The Web Development Bootcamp on Udemy. I undertook this project to learn the basic JavaScript web development stack: MongoDB, Express, and Node. I then made some of my own modifications by adding a password reset feature, upgrading the database to Mongo Atlas, and changing the style for several of the views.",
    "next": "What's next?: Add date created for campgrounds and comments.",
    "url": "https://davegentilli-yelpcamp.herokuapp.com/",
    "github": "https://github.com/dgentilli/yelpcamp",
    "featured": true,
    "basic": false,
    "video": "/assets/video/yelpcampv2.mp4",
    "poster": "/assets/video/yelpcamp-poster.PNG"
  },
  {
    "id": "chat",
    "name": "Chat App",
    "tags": [
      "JavaScript | ",
      "ES6 ",
      "MongoDB | ",
      "Express | ",
      "React | ",
      "Node | ",
      "Redux | ",
      "Socket.io | ",
      "Passport | ",
      "REST API | ",
      "React Bootstrap"
    ],
    "stack": ["MongoDB ", "Express ", "React ", "Node"],
    "preview": "This app offers instant communication between two users. It includes a login/logout feature to simulate the basic security of a production app. The current version...",
    "summary": "This app offers instant communication between two users. It includes a login/logout\n\n  feature to simulate the basic security of a production app. The current version allows visitors to try the app with the supplied login credentials for two demo users, Homer and Marge.",
    "approach": "Technical approach: This was the first app I built on my own, albeit with help from a mentor. My goal was to sharpen my understanding of React and build an app on the MERN stack. This was an awesome full-stack learning experience because many of the technologies required me to understand how different parts of the app work together (Redux, Socket.io, and Passport). Using these techologies has also left the door open for quickly scaling up to a production app.",
    "next": "What's next?: Allow visitors to create new accounts and have their own private chats.",
    "url": "https://davegentilli-chat.herokuapp.com/",
    "github": "https://github.com/dgentilli/chat-app-mern",
    "featured": true,
    "basic": false,
    "video": "/assets/video/chat.mp4",
    "poster": "/assets/video/chat-poster.PNG"
  },

  {
    "id": "portfolio",
    "name": "Portfolio",
    "tags": [
      "JavaScript | ",
      "ES6 | ",
      "MongoDB | ",
      "Express | ",
      "React | ",
      "Node | ",
      "Redux | ",
      "Embedded video | ",
      "React Router | ",
      "React Material Components"
    ],
    "stack": ["Express ", "React ", "Node"],
    "preview": "I designed this with the help of a mentor but wrote the code almost entirely on my own. Showcasing my projects was the main goal. By using React...",
    "summary": "I designed this with the help of a mentor but wrote the code almost entirely on my own. Showcasing my projects was the main goal. By using React I continued to sharpen my skills while providing an interface that is both fast and user-friendly.",
    "approach": "Technical approach: The goal was to create a professional looking portfolio while enhancing my MERN stack skills. Incorporating technology such as React Router, React Material Components, and Video-React added even more to my skillset! ",
    "next": "What's next?: Update with new projects. Add a feature that will allow visitors to sort projects by type of technology (i.e. React, Vanilla JS, jQuery, etc.).",
    "url": "http://www.davegentilli.com/",
    "github": "https://github.com/dgentilli/portfolio",
    "featured": true,
    "basic": false,
    "video": "/assets/video/portfolio.mp4",
    "poster": "/assets/video/portfolio-poster.PNG"
  },
  {
    "id": "weather",
    "name": "Weather App",
    "tags": [
      "JavaScript | ",
      "ES6 | ",
      "Express | ",
      "Node | ",
      "3rd Party API | ",
      "DOM Manipulation | ",
      "jQuery"
    ],
    "stack": ["Front-end app"],
    "preview": "A simple weather app using Open Weather Map's free API, this app can be incorporated into any larger application to provide users...",
    "summary": "A simple weather app using Open Weather Map's free API, this app can be incorporated\n\n  into any larger application to provide users with a summary forecast for their area.",
    "approach": "Technical approach: I wanted to sharpen my vanilla JavaScript skills, so I did this code along project from Modern JavaScript from the Beginning, a course on Udemy. It was a good refresher on DOM manipulation and using 3rd party APIs, as well as my first experience using modals and local storage. I modified it by using a different weather API and deploying it on Heroku. You'll notice I mention jQuery in a vanilla JS project. Why? It needed one line of jQuery to make the modal work.",
    "next": "What's next?: Toggle between Celsius and Fahrenheit.",
    "url": "https://davegentilli-weather.herokuapp.com/",
    "github": "https://github.com/dgentilli/weather-vanillajs",
    "featured": false,
    "basic": true,
    "video": "/assets/video/weather.mp4",
    "poster": "/assets/video/weather-poster.PNG"
  },
  {
    "id": "contact",
    "name": "Contact Form",
    "tags": ["JavaScript | ", "ES6 | ", "Express | ", "Node | ", "SendGrid"],
    "stack": ["Express ", "Node"],
    "preview": "A contact form that allows users to leave contact details and a short message. Perfect for any small business that wants a simple interface...",
    "summary": "A contact form that allows users to leave contact details and a short message. Perfect\n\n for any small business that wants a simple interface for new clients while looking professional. I use a variation of it for the contact form in this portfolio.",
    "approach": "Technical approach: After getting my feet wet with JavaScript through code-along exercises, I built this project as part of a personalized training course with a mentor. I improved my JavaScript and jQuery skills while learning how to make Ajax calls and use the SendGrid API. This version uses jQuery, but the contact form for this portfolio does not -- it uses Fetch instead of Ajax.",
    "next": "What's next?: Adapt this for my first client project.",
    "url": "https://davegentilli-contact.herokuapp.com/",
    "github": "https://github.com/dgentilli/contact-form",
    "featured": false,
    "basic": true,
    "video": "/assets/video/contact.mp4",
    "poster": "/assets/video/contact-poster.PNG"
  },
  {
    "id": "todo",
    "name": "To-Do List",
    "tags": [
      "JavaScript | ",
      "Node | ",
      "jQuery | ",
      "DOM Manipulation | ",
      "Front end skills"
    ],
    "stack": ["Front-end app"],
    "preview": "Offers a simple user interface for keeping track of to-do lists. Easy to use.",
    "summary": "Offers a simple user interface for keeping track of to-do lists. Easy to use.",
    "approach": "Technical approach: This was the first project I built on the way to becoming a web developer. It was another code along from The Web Developer Bootcamp on Udemy. The main takeaways were gaining an understanding of how to manipulate the DOM with jQuery and strengthening my CSS skills. I modified the UI to be more intuitive and used Node to deploy with Heroku.",
    "next": "What's next?: Keep track of to do items.",
    "url": "https://davegentilli-todo.herokuapp.com/",
    "github": "https://github.com/dgentilli/to-do-jquery",
    "featured": false,
    "basic": true,
    "video": "/assets/video/todo.mp4",
    "poster": "/assets/video/todo-poster.png"
  }
]
